# モジュール 7 - ラボ 1 - 演習 3 - スケジュールされたクエリを作成する

### タスク 1: スケジュール済みクエリを作成します。

このタスクでは、スケジュールされたクエリを作成します。

1. 管理者として WIN1 仮想マシンにログインします。パスワードは **Pa55w.rd** です。  

2. **サインイン**ダイアログボックスで、ラボ ホスティング プロバイダーから提供された**テナントの電子メール** アカウントをコピーして貼り付け、「**次へ**」を選択します。

3. **パスワードの入力**ダイアログ ボックスで、ラボ ホスティング プロバイダーから提供された**テナントパスワード** をコピーして貼り付け、「**サインイン**」を選択します。

4. Azure ポータルの検索バーに 「*Sentinel*」 と入力し、「**Azure Sentinel**」 を選択します。

5. Azure Sentinel ワークスペースを選択します。

6. 構成領域から「**分析**」を選択します。

7. **作成**ボタンを選択し、「**スケジュールされたクエリルール**]を選択します。

8. 全般タブで、「*非アクティブなアカウントの名前サインイン試行*」を入力します。

9. タクティクスで、「**初期アクセス**」を選択します。

10. 重要度では、「**中**」を選択します

11. **次へ:** を選択します。「**ルール ロジックを設定 >**」 ボタン:

12. ルールクエリの場合は、次 KQL ステートメントを貼り付けます。

SigninLogs
| where ResultType == "50057"
| where ResultDescription =~ "User account is disabled. The account has been disabled by an administrator."
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), count(), applicationCount = dcount(AppDisplayName), 
applicationSet = makeset(AppDisplayName) by UserPrincipalName, IPAddress
| extend timestamp = StartTimeUtc, AccountCustomEntity = UserPrincipalName, IPCustomEntity = IPAddress

**警告:** 仮想マシンへの貼り付け機能を使用する場合。  追加 | （パイプ）文字を追加できます。  貼り付けたものが次の KQL ステートメントのようになっていることを確認してください。

**注:** 「クエリ結果の表示」へのリンクを選択した場合、結果は表示されません。  エラーが表示されないことを確認します。  

13. エンティティのマップを確認します。  クエリ出力には次のフィールドが含まれているため、エンティティはクエリでマップされたものとして表示されます。

timestamp = StartTimeUtc, AccountCustomEntity = UserPrincipalName, IPCustomEntity = IPAddress

14. 分析ルールウィザードに戻ります-クエリスケジュール領域に新しいルールブレードを作成し、「**5**」 と入力して、クエリを実行するすべてのオプションで「**分**」を選択します。

15. クエリのスケジュール領域で、「**1**」 を入力し、最後のオプションからルックアップデータの「**日数**」を選択します。

16. アラートスレッショルド領域では、オプションを変更しないでください。

**注:** 一番の練習はアラートルールの KQL クエリステートメントでスレッショルドを管理することです。

17. イベントグループ化領域では、選択したオプションとして、**すべてのイベントを1つのアラートにグループ化**したままにします。

18. **次へ:** を選択します。**インシデント設定**ボタン。  

19. インシデント設定タブで、既定のオプションを確認します。

20. **次へ:** を選択します。**自動応答** ボタン

21. 自動応答タブで、以前に作成したハンドブックの Post-Message-Teams を選択します。

22. **次へ:** を選択します。**レビュー**ボタン
  
23. **「作成」** を選択します。

### タスク 2: 新しいルールをテストします。

このタスクでは、新しいスケジュールされたクエリルールのテストを作成します

1. Azure ポータルの検索バーに 「*Azure Active Directory*」 と入力します。「*Azure Active Directory*」 を選択します。

2. アクセス許可エリアで「**ユーザー**」を選択します。

3. リストからユーザー 「**ChristieCline**」 を選択します。The Christie Cline | プロフィールページが表示されます。

4. 「**編集**」を選択します。

5. 設定領域で、**サインインのブロック** を 「**はい**」に変更します。

6. コマンド バーで、「**保存**」を選択します。

7. Azure ポータルで、右上のユーザーアバターを選択し、サインアウトします。

8. ブラウザーを閉じます。

9. ブラウザを開いて https://portal.office.com に移動し、ユーザー ChristieC@**Tenant Email domain** でログインしてみます。テナントの電子メールドメインとパスワードは、管理者のテナントパスワードと同じである必要があります。  アカウントがロックされているという警告が表示されます。

10. ブラウザーを閉じます。アラートが処理されるまで 10 分待ちます。

11.  Edge ブラウザーで Azure portal に移動します https://portal.azure.com。

12. **サインイン**ダイアログボックスで、ラボのホスティングプロバイダーから提供された**テナントの電子メール**アカウントをコピーして貼り付け、「**次へ**」を選択します。

13. **パスワードの入力**ダイアログ ボックスで、ラボ ホスティング プロバイダーから管理者ユーザーに提供された**テナントパスワード** をコピーして貼り付け、「**サインイン**」を選択します。

14. Azure ポータルの検索バーに 「*Sentinel*」 と入力し、「**Azure Sentinel**」 を選択します。

15. Azure Sentinel ワークスペースを選択します。

16. **インシデント** メニュー オプションを選択します。

17. 新しく作成したインシデントが表示されます。  インシデントを選択し、右側のブレードの情報を確認します。

18. Microsoft Teams を開きます。*SOC* チームに移動し、...そしてインシデントに関するメッセージ投稿を参照してください。

## 演習 4 に進みます。