# モジュール 5-Lab 1- 演習 1 - Azure Sentinel 環境を構成する

## ラボ シナリオ

あなたは、Azure Sentinel を実装しようとしている企業で働いているセキュリティ オペレーションアナリストです。コストを最小限に抑え、コンプライアンス規制を満たし、セキュリティ チームが日常の職務を遂行するのに最も管理しやすい環境を提供するという会社の要件を満たすように、Azure Sentinel 環境を設定する責任があります。

### タスク 1: Azure Sentinel ワークスペースを初期化する。

このタスクでは、Azure Sentinel ワークスペースを作成します。

1. 管理者として WIN1 仮想マシンにログインします。パスワードは **Pa55w.rd** です。  

2.  ブラウザを開き、新しい Microsoft Edge ブラウザを検索、ダウンロード、およびインストールします。新しい Edge ブラウザーを起動します。

3.  Edge ブラウザーで Azure ポータルに移動します https://portal.azure.com

4. **サインイン**ダイアログボックスで、ラボ ホスティング プロバイダーから提供された**テナントの電子メール**アカウントをコピーして貼り付け、「**次へ**」 を選択します。

5. **パスワードの入力**ダイアログ ボックスで、ラボ ホスティング プロバイダーから提供された**テナントパスワード** をコピーして貼り付け、「**サインイン**」を選択します。

6. Azure ポータルの検索バーに 「*Sentinel*」 と入力し、「**Azure Sentinel**」 を選択します。

7. 「**+ 作成**」を選択します。

8. 「**+ 新しいワークスペースの作成**」を選択します。

9. 適切なサブスクリプションを選択します。

10. リソースグループの**新規作成**リンクを選択し、選択した新しいリソースグループ名を入力します。

11. 名前 フィールドの インスタンスの詳細 で、LogAnalytics ワークスペースに選択する名前を入力します。

**注:** この名前は、Azure Sentinel ワークスペース名にもなります。

12. **地域** として **米国東部** を選択する。

13. 「**レビュー + 作成**」 を選択します。

14. 「**作成**」を選択します。新しい LogAnalytics ワークスペースが 「ワークスペースへの Azure Sentinel の追加」ページのリストに表示されるのを待ちます。  これには時間がかかることがあります。

16. 新しく作成されたワークスペースが表示されたらそれを選択し、「**追加**」を選択します。

### タスク 2: ウォッチリストを作成する。

このタスクでは、Watchlist を作成します。

1. Azure Portal に接続しているPCで、メモ帳(notepad.exe）を開きます。

2. １行目に *Hostname* と入力し、新しい行を入力します。

3. 行2～6に、次のホスト名を追加します。
    Host1
    Host2
    Host3
    Host4
    Host5

4. *HighValue.csv* という名前を付けて保存します。このときファイル タイプを **すべてのファイル(*.*)** に変更してから保存してください。

5. メモ帳を閉じます。

6. Azure Sentinel で、**構成** の「**ウォッチリスト**」オプションを選択します。

7. コマンド バーから 「**＋新規追加**」を選択します。

8. ウォッチリストウィザードで、次のように入力します。
    名前: HighValueHosts
    説明: High Value Hosts
    ウォッチリストエイリアス： HighValueHosts

9. **次へ:ソース >** を選択します。

10. 作成した *HighValue.csv* ファイルを読み込みます。

11. SearchKey フィールドで **Hostname** を選択します。

11. **次へ:確認と作成 >** を選択します。

12. 「**作成**」を選択します。

13. 画面がウォッチリストリストに戻ります。

14. **HighValueHosts** ウォッチリストを選択します。  右側のタブで、「**Log Analytics で表示**」を選択します。

15. 次の KQL ステートメントが自動的に実行され、結果が表示されます。

```KQL
_GetWatchlist('HighValueHosts')
```
**注** 完了するまで少し時間がかかります。

独自のKQLステートメントで _GetWatchlist（'HighValueHosts'） を使用して、リストにアクセスできるようになりました。参照する列は *Hostname* になります。

### タスク 3: 脅威インジケーターを作成する。

このタスクでは、インジケーターを作成します。

1. Azure Sentinel で、脅威管理構成領域の「**脅威インテリジェンス**」オプションを選択します。

2. コマンド バーから 「**+新規追加**」を選択します。

3. タイプドロップダウンで使用可能なさまざまなインジケータータイプを確認します。  そして、「**domain-name**」を選択します。ドメインボックスに"適当な"ドメイン名を入力します。たとえば、ご自身のイニシャルを使用して、**ja.com** などです。

4. **脅威の種類**として、「**anomalous-activity(悪意のあるアクティビティ)**」を選択します。

5. **名前**には、ドメインに使用されているのと同じものを入力します。たとえば、**ja.com** などです。

6. **有効期間の開始日**を今日の日付に設定します。

7. 「**適用**」を選択します。

**注** インジケーターが表示されるまで少し時間がかかる場合があります。

8. **全般**領域で「**ログ**」オプションを選択します。

9. 以下の KQL ステートメントを実行します。

```KQL
ThreatIntelligenceIndicator 
```
**注** インジケーターが表示されるまで少し時間（５分程度）がかかる場合があります。

結果を右にスクロールして、DomainName 列を表示します。次の KQ Lステートメントを実行して、DomainName 列だけを表示することもできます。  

```KQL
ThreatIntelligenceIndicator 
| project DomainName
```
## これでラボは完了です。
