# モジュール 7 - ラボ 1 - 演習 3 - スケジュールされたクエリを作成する

### タスク 1: スケジュール済みクエリを作成します。

このタスクでは、スケジュールされたクエリを作成し、前の演習で作成した Teams チャネルに接続します。

1. 管理者として WIN1 仮想マシンにログインします。パスワードは**Pa55w.rd** です。  

2. **サインイン** ダイアログ ボックスで、ラボ ホスティング プロバイダーから提供された**テナントのメール** アカウントをコピーして貼り付け、「**次へ**」を選択します。

3. **パスワードの入力**ダイアログ ボックスで、ラボ ホスティング プロバイダーから提供された**テナントパスワード** をコピーして貼り付け、「**サインイン**」を選択します。

4. Azure portal の検索バーに「*Sentinel*」と入力してから、「**Azure Sentinel**」を選択します。

5. Azure Sentinel ワークスペースを選択します。

6. 構成領域から「**分析**」を選択します。

7. 「**+ 作成**」ボタンを選択し、「**スケジュールされたクエリ ルール**」を選択します。

8. 分析ルール ウィザードの「全般」タブで、名前 *Azure AD Role Assignment Audit Trail* を入力します。

9. 戦術については、「**常設**」を選択します。

10. 重要度については、「**低**」を選択します。

11. 「**次へ: ルール ロジックを設定 >**」ボタンを選択します。

12. ルールクエリの場合は、次のKQLステートメントを貼り付けます。

**警告:** 仮想マシンへの貼り付け機能を使用する場合。  追加 | （パイプ）文字を追加できます。まず、メモ帳を使用して、次のクエリを貼り付けてください。

```KQL
AuditLogs 
| where isnotempty(InitiatedBy.user.userPrincipalName) and Result == 'success' and OperationName contains "member to role" and AADOperationType startswith "Assign"
| extend InitiatedByUPN = tostring(InitiatedBy.user.userPrincipalName)
| extend InitiatedFromIP = iff(tostring(AdditionalDetails.[7].value) == '', tostring(AdditionalDetails.[6].value), tostring(AdditionalDetails.[7].value))
| extend TargetUser = tostring(TargetResources.[2].displayName)
| extend TargetRoleName = tostring(TargetResources.[0].displayName)
| project TimeGenerated, InitiatedByUPN, InitiatedFromIP, TargetUser, TargetRoleName, AADOperationType, OperationName
```

**注:** "クエリ結果の表示" へのリンクを選択した場合、結果またはエラーは表示されません。エラーが表示された場合は、クエリが以前の KQL ステートメントに類似していることを確認してください。

13. "Analytics rule wizard - Create new scheduled rule" (分析ルール ウィザード - 新しいスケジュールされたルールの作成) ブレードに戻り、「*Alert enrichment (Preview)*」 (アラート エンリッチメント (プレビュー)) 領域で、「*エンティティ マッピング*」を選択し、次の値を選択します。**エンティティの種類:** アカウント、**識別子:** FullName、**値:** InitiatedByUPN、次に「*新しいエンティティの追加*」を選択し、次の値をを選択します。**エンティティの種類:** IP、**識別子:** アドレス、**値:** InitiatedFromIP

14. *クエリ スケジューリング*領域で、**5** を入力し、「*Run query every*」 (クエリの実行間隔) オプションに対して「**分**」を選択し、**1** を入力し、「*Lookup data from the last*」 (データのルックアップ期間) オプションに対して「**日**」を選択します。

**注:** じデータに対して意図的に多くのインシデントを生成しています。  これにより、ラボはこれらのアラートを使用できるようになります。

15. *アラート スレッショルド*領域では、オプションを変更しないでください。

**注:** 一番の練習はアラートルールのKQLクエリステートメントでスレッショルドを管理することです。

16. *イベント グループ化*領域では、選択したオプションとして、**すべてのイベントを 1 つのアラートにグループ化**したままにします。

17. 「**次へ: インシデント設定 >**」ボタンを選択します。  

18. *インシデント設定 (プレビュー)* タブで、既定のオプションを確認します。

19. 「**次へ: 自動応答 >**」ボタンを選択します。

20. 「*アラートの自動化*」領域の「自動応答」タブで、前の演習で作成したプレイブック *PostMessageTeams-OnAlert* を選択します。

22. 「**次へ: 確認 >**」ボタンを選択します。
  
23. 「**作成**」 を選択します。

### タスク 2: 新しいルールをテストします。

このタスクでは、新しいスケジュールされたクエリルールをテストします

1. Azureポータルの検索バーに「*Azure Active Directory*」と入力します。「**Azure Active Directory**」を選択します。

2. 管理領域で「**ユーザー**」を選択し、"ユーザー | すべてのユーザー (プレビュー)" ページが表示されるようにします。

3. リストからユーザー「**Christie Cline**」を選択すると、"Christie Cline の | プロファイル" ページが表示されます。

4. 管理領域で「**割り当てられたロール**」を選択し、"Christie Cline | 割り当てられたロール" ページが表示されます。

5. コマンド バーから「**+ 割り当ての追加**」を選択します。

6. *割り当ての追加*ページの*メンバーシップ*タブの「*ロールの選択*」の下で、「**ユーザー管理者**」を選択し、「**次へ >**」を選択します。

7. *設定タブで既定の*割り当ての種類*を確認し、「**割り当て**」を選択します。割り当ての完了に失敗した場合は、再試行してください。

8. "Christie Cline | の割り当てられたロール" と "ユーザー | すべてのユーザー (プレビュー)" ページを右上の「x」を 2 回選択して閉じます。

9. "Contoso | の概要" ページの「*監視*」の下で、「**監査ログ**」を選択します。

10. 「**Export data settings**」 (データ設定のエクスポート) を選択して、"Azure Active Directory" のデータ コネクタが、Sentinel で正しく設定されていることを確認します。

11. Sentinel に対して以前に作成した *Log Analytics ワークスペース*の*診断設定*エントリがあることを確認します。

12. 右上の「x」を選択して、ページを閉じます。

13. 「**更新**」を以前に作成したロールに変更を示す*カテゴリ: RoleManagement* に対するエントリが表示されるまで選択します。

14. Azure portal の検索バーに「*Sentinel*」と入力してから、「**Azure Sentinel**」を選択します。

15. Azure Sentinel ワークスペースを選択します。

16. **インシデント** メニュー オプションを選択します。

**注:** トリガーされたアラートの処理には 5 分以上かかる場合があります。次の演習を続けて、後でこのポイントに戻ることができます。インシデント ページの自動更新については、「**Auto-refresh incidents**」 (インシデントの自動更新) トグルを選択します。

17. 新しく作成したインシデントが表示されます。インシデントを選択し、右側のブレードの情報を確認します。

18. ブラウザー タブを開き、https://teams.microsoft.com にアクセスして、Microsoft Teams を開きます。*SOC* チームに移動し、インシデントに関するメッセージ投稿を参照してください。

## 演習 4 に進みます。
