# モジュール 7 - ラボ 1 - 演習 3 - スケジュールされたクエリを作成する

### タスク 1: スケジュール済みクエリを作成します。

このタスクでは、スケジュールされたクエリを作成し、前の演習で作成した Teams チャネルに接続します。

1. 管理者として WIN1 仮想マシンにログインします。パスワードは **Pa55w.rd**。  

2. **サインイン** ダイアログ ボックスで、ラボ ホスティング プロバイダーから提供された**テナントの電子メール**アカウントをコピーして貼り付け、「**次へ**」を選択します。

3. **パスワードの入力**ダイアログ ボックスで、ラボ ホスティング プロバイダーから提供された**テナントパスワード** をコピーして貼り付け、「**サインイン**」を選択します。

4. Azureポータルの検索バーに「*Sentinel*」と入力し、「**Azure Sentinel**」を選択します。

5. Azure Sentinel ワークスペースを選択します。

6. 構成領域から「**分析**」を選択します。

7. 「**+ 作成**」ボタンを選択し、「**スケジュールされたクエリルール**」を選択します。

8. 分析ルール ウィザードの「全般」タブで、「*非アクティブなアカウントの名前サインイン試行*」を入力します。

9. 「方針」で、「**Intial Access**」を選択します。

10. 重要度では、「**中**」を選択します。

11. 「**次へ: ルール ロジックを設定　>**」ボタンを選択します。

12. 「ルールのクエリ」に、次のKQLステートメントを貼り付けます。

```KQL
SigninLogs
| where ResultType == "50057"
| where ResultDescription =~ "User account is disabled. The account has been disabled by an administrator."
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), count(), applicationCount = dcount(AppDisplayName), 
applicationSet = makeset(AppDisplayName) by UserPrincipalName, IPAddress
| extend timestamp = StartTimeUtc, AccountCustomEntity = UserPrincipalName, IPCustomEntity = IPAddress
```

**警告:** 貼り付けたものが前の KQL ステートメントのようになっていることを確認してください。

**注:** 「クエリ結果の表示」へのリンクを選択した場合、結果は表示されません。  エラーが表示されないことを確認します。  

13. 分析ルールウィザード - scheduled ルールの新規作成 に戻ります - クエリスケジュール領域の*実行間隔*オプションで、「**5**」と入力して、「**分**」を選択します。

14. クエリのスケジュール領域の*次の時間分の過去データを参照します*オプションで、「**1**」を入力し、「**日**」を選択します。

15. アラートしきい値領域では、オプションを変更しないでください。 

**注:** ベストプラクティスは、アラートルールのKQLクエリステートメントで閾値を管理することです。

16. イベントグループ化領域では、選択したオプションとして、**すべてのイベントを1つのアラートにグループ化**したままにします。

17. 「**次へ: インシデント設定 >**」ボタンを選択します。  

18. インシデント設定タブで、既定のオプションを確認します。

19. 「**次へ: 自動応答 >**」ボタンを選択します。

20. 「自動応答」タブの「アラートの自動化」領域で、前の演習で作成したプレイブック *PostMessageTeams-OnAlert* を選択します。

22. 「**次へ: レビュー >**」ボタンを選択します。
  
23. 「**作成**」を選択します。

### タスク 2: 新しいルールをテストします。

このタスクでは、新しいスケジュールされたクエリルールをテストします

1. Azureポータルの検索バーに「*Azure Active Directory*」と入力します。「**Azure Active Directory**」を選択します。

2. アクセス許可エリアで「**ユーザー**」を選択します。

3. リストからユーザー「**ChristieCline**」を選択すると、Christie Cline の | プロフィール ページが表示されます。

4. コマンド バーから 「**編集**」を選択します。

5. 設定領域で、**サインインのブロック**を「**はい**」に変更します。

6. コマンド バーで、「**保存**」を選択します。

7. Azure ポータルで、右上のユーザーアバターを選択し、サインアウトします。

8. ブラウザーを閉じます。

9. Microsoft Edge で新しいプライベート ブラウジング セッションを開き、https://portal.office.com に移動して、ユーザー ChristieC@ でログインしてみます。**テナント メール ドメイン**とパスワードは、管理者のテナントパスワードと同じである必要があります。  アカウントがロックされているという警告が表示されます。これは良いことです。アクションはアラートをトリガーするはずです。

10. ブラウザーを閉じます。最後のステップでトリガーされたアラートの処理には 10 分かかる場合があります。次の演習を続けて、後でこのポイントに戻ることができます。

11. Edge ブラウザーで Azure portal に移動します　https://portal.azure.com。

12. **サインイン**ダイアログ ボックスで、ラボのホスティングプロバイダーから提供された**テナントの電子メール**アカウントをコピーして貼り付け、「**次へ**」を選択します。

13. **パスワードの入力**ダイアログ ボックスで、ラボ ホスティング プロバイダーから管理者ユーザーに提供された**テナントパスワード** をコピーして貼り付け、「**サインイン**」を選択します。

14. Azure ポータルの検索バーに「*Sentinel*」と入力し、「**Azure Sentinel**」を選択します。

15. Azure Sentinel ワークスペースを選択します。

16. **インシデント** メニュー オプションを選択します。

17. 新しく作成したインシデントが表示されます。  インシデントを選択し、右側のブレードの情報を確認します。

18. ブラウザー タブを開き、https://teams.microsoft.com にアクセスして、Microsoft Teams を開きます。*SOC* チームに移動し、インシデントに関するメッセージ投稿を参照してください。

## 演習 4 に進みます。
